Autodesk.Revit.DB.WallType.Width
The overall thickness of this type of wall.

Autodesk.Revit.DB.WallType.Kind
The nature of the wall.

Autodesk.Revit.DB.WallType.ThermalProperties
The calculated and settable thermal properties of the WallType
Remarks:
Returns null if the wall has no thermal properties.
Curtain walls and stacked walls do not store thermal properties.
Since:
2013

Autodesk.Revit.DB.WallType.Function
The wall function.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.WallType
Represents a specific type of wall, such as 'Generic -8" '.
Remarks:
All wall type objects available in the project can be retrieved from the Document object
via the WallTypes property. Every Wall object has a WallType property that returns the a
WallType object representing the type. This same WallType property can also be used to
change the type of the wall by setting it to a different type.